---
kind: other
id: Methods.T:Autodesk.Revit.DB.Visual.Asset
source: html/bece1eee-4fe9-f3e4-59a0-07fd4fbf5eca.htm
---
# Asset Methods

Adds a new connected asset attached to this asset property, if it allows it.